{
  "version": "2.0",
  "config": {
    "vocabSize": 567,
    "embeddingDim": 64,
    "numLayers": 2,
    "numHeads": 4,
    "vocab": [
      "[PAD]",
      "[UNK]",
      "[EOS]",
      "[BOS]",
      ".",
      "the",
      ",",
      "and",
      "models",
      "of",
      "to",
      "for",
      "model",
      "language",
      "in",
      "training",
      "are",
      "on",
      "a",
      "more",
      "this",
      "is",
      "like",
      "learning",
      "can",
      "data",
      "that",
      "tasks",
      "with",
      "text",
      "words",
      "as",
      "help",
      "they",
      "process",
      "attention",
      "size",
      "using",
      "large",
      "tokenization",
      "techniques",
      "important",
      "larger",
      "new",
      "powerful",
      "patterns",
      "human",
      "has",
      "use",
      "allows",
      "sequence",
      "when",
      "about",
      "vectors",
      "where",
      "gradient",
      "or",
      "how",
      "rate",
      "performance",
      "but",
      "ai",
      "networks",
      "learn",
      "processing",
      "understand",
      "have",
      "become",
      "making",
      "input",
      "predictions",
      "these",
      "trained",
      "amounts",
      "many",
      "involves",
      "even",
      "between",
      "by",
      "into",
      "common",
      "include",
      "affects",
      "learned",
      "well",
      "require",
      "memory",
      "smaller",
      "may",
      "modeling",
      "research",
      "perform",
      "inference",
      "time",
      "makes",
      "simple",
      "test",
      "neural",
      "from",
      "natural",
      "deep",
      "intelligence",
      "transformers",
      "network",
      "mechanisms",
      "different",
      "transformer",
      "architectures",
      "applications",
      "previous",
      "capture",
      "world",
      "some",
      "reasoning",
      "crucial",
      "represent",
      "similar",
      "be",
      "compute",
      "value",
      "weights",
      "query",
      "key",
      "multiple",
      "each",
      "layer",
      "representations",
      "approaches",
      "encoding",
      "model's",
      "vocabulary",
      "its",
      "ability",
      "handle",
      "rare",
      "positional",
      "information",
      "order",
      "essential",
      "during",
      "measures",
      "outputs",
      "adapt",
      "overfitting",
      "decay",
      "both",
      "computational",
      "vocabularies",
      "efficient",
      "specific",
      "across",
      "metrics",
      "generation",
      "generated",
      "better",
      "make",
      "one",
      "at",
      "provide",
      "decisions",
      "tracking",
      "specialized",
      "devices",
      "batches",
      "most",
      "without",
      "aligned",
      "current",
      "knowledge",
      "systems",
      "ways",
      "quick",
      "brown",
      "fox",
      "jumps",
      "over",
      "lazy",
      "dog",
      "sentence",
      "pipeline",
      "machine",
      "fascinating",
      "complex",
      "enables",
      "computers",
      "revolutionized",
      "artificial",
      "type",
      "architecture",
      "incredibly",
      "popular",
      "recent",
      "years",
      "self-attention",
      "sequences",
      "them",
      "particularly",
      "effective",
      "mechanism",
      "focus",
      "parts",
      "gpt",
      "bert",
      "built",
      "massive",
      "generate",
      "coherent",
      "contextually",
      "appropriate",
      "translation",
      "summarization",
      "question",
      "answering",
      "other",
      "predicting",
      "next",
      "word",
      "given",
      "objective",
      "applied",
      "billions",
      "results",
      "sophisticated",
      "grammar",
      "facts",
      "abilities",
      "embeddings",
      "component",
      "dense",
      "high-dimensional",
      "space",
      "close",
      "together",
      "semantic",
      "relationships",
      "example",
      "\"king\"",
      "\"queen\"",
      "might",
      "dimensions",
      "weighted",
      "sums",
      "determined",
      "similarity",
      "multi-head",
      "uses",
      "sets",
      "projections",
      "allowing",
      "attend",
      "aspects",
      "simultaneously",
      "feed-forward",
      "applies",
      "non-linear",
      "transformations",
      "normalization",
      "residual",
      "connections",
      "stability",
      "flow",
      "architectural",
      "choices",
      "critical",
      "effectively",
      "converting",
      "discrete",
      "units",
      "word-level",
      "character-level",
      "subword",
      "algorithms",
      "byte",
      "pair",
      "choice",
      "strategy",
      "unseen",
      "adds",
      "position",
      "tokens",
      "since",
      "don't",
      "built-in",
      "notion",
      "recurrent",
      "encodings",
      "fixed",
      "mathematical",
      "functions",
      "parameters",
      "through",
      "backpropagation",
      "descent",
      "loss",
      "function",
      "match",
      "target",
      "optimizers",
      "adam",
      "parameter",
      "based",
      "history",
      "gradients",
      "occurs",
      "memorizes",
      "rather",
      "than",
      "generalizable",
      "dropout",
      "weight",
      "early",
      "stopping",
      "prevent",
      "regularization",
      "encourages",
      "simpler",
      "robust",
      "an",
      "hyperparameter",
      "efficiency",
      "directly",
      "computation",
      "struggle",
      "pre-training",
      "fine-tuning",
      "paradigm",
      "modern",
      "nlp",
      "first",
      "pre-trained",
      "unlabeled",
      "self-supervised",
      "objectives",
      "then",
      "fine-tuned",
      "downstream",
      "labeled",
      "transfer",
      "approach",
      "led",
      "significant",
      "improvements",
      "evaluation",
      "vary",
      "depending",
      "task",
      "perplexity",
      "predicts",
      "set",
      "classification",
      "accuracy",
      "precision",
      "recall",
      "f1",
      "score",
      "commonly",
      "used",
      "bleu",
      "rouge",
      "compare",
      "reference",
      "texts",
      "scaling",
      "laws",
      "describe",
      "improves",
      "increases",
      "dataset",
      "shown",
      "generally",
      "though",
      "diminishing",
      "returns",
      "driven",
      "trend",
      "toward",
      "ever-larger",
      "often",
      "autoregressive",
      "generates",
      "token",
      "own",
      "inputs",
      "beam",
      "search",
      "nucleus",
      "sampling",
      "improve",
      "quality",
      "diversity",
      "reveal",
      "what",
      "focuses",
      "visualizing",
      "insights",
      "heads",
      "specialize",
      "linguistic",
      "phenomena",
      "such",
      "syntactic",
      "dependencies",
      "identifying",
      "named",
      "entities",
      "cost",
      "substantial",
      "requiring",
      "hardware",
      "gpus",
      "tpus",
      "distributed",
      "faster",
      "accumulation",
      "mixed-precision",
      "manage",
      "constraints",
      "batch",
      "speed",
      "stable",
      "estimates",
      "add",
      "noise",
      "which",
      "sometimes",
      "generalization",
      "schedules",
      "adjust",
      "strategies",
      "linear",
      "warm-up",
      "followed",
      "hyperparameters",
      "tune",
      "successful",
      "compression",
      "quantization",
      "pruning",
      "distillation",
      "reduce",
      "while",
      "maintaining",
      "it",
      "possible",
      "deploy",
      "resource-constrained",
      "zero-shot",
      "few-shot",
      "demonstrate",
      "explicit",
      "those",
      "conditioning",
      "few",
      "examples",
      "prompt",
      "ethical",
      "considerations",
      "increasingly",
      "issues",
      "bias",
      "potential",
      "misuse",
      "environmental",
      "impact",
      "questions",
      "intellectual",
      "property",
      "attribution",
      "future",
      "likely",
      "methods",
      "paradigms",
      "controllable",
      "interpretable",
      "values",
      "multimodal",
      "extend",
      "images",
      "audio",
      "video",
      "addition",
      "opens",
      "up",
      "ground",
      "perceptual",
      "experience",
      "planning",
      "capabilities",
      "limited",
      "compared",
      "neuro-symbolic",
      "incorporating",
      "external",
      "sources",
      "bridge",
      "gap",
      "continual",
      "addresses",
      "challenge",
      "updating",
      "forgetting",
      "previously",
      "keeping",
      "evolve",
      "domain",
      "adaptation",
      "domains",
      "medicine",
      "law",
      "science",
      "differ",
      "general",
      "interactive",
      "conversational",
      "foundation",
      "additional",
      "components",
      "dialogue",
      "management",
      "context",
      "user",
      "explainability",
      "interpretability",
      "users",
      "why",
      "particular",
      "building",
      "trust",
      "debugging",
      "behavior",
      "safety",
      "alignment",
      "aims",
      "ensure",
      "behave",
      "beneficial",
      "intentions",
      "capable",
      "democratization",
      "tools",
      "accessible",
      "people",
      "enabling",
      "innovation",
      "reducing",
      "barriers",
      "entry",
      "field",
      "education",
      "literacy",
      "helping",
      "society",
      "navigate",
      "opportunities",
      "challenges",
      "technologies",
      "present",
      "collaboration",
      "researchers",
      "practitioners",
      "policymakers",
      "public",
      "shaping",
      "development",
      "deployment",
      "benefit",
      "humanity"
    ]
  },
  "weights": {
    "embedding": [
      [
        -0.08588485388874711,
        0.0928436055262018,
        0.03866989357937983,
        0.061009579215365095,
        0.028526411023600262,
        0.10458397217340576,
        0.11869563344472073,
        -0.025813297483898157,
        -0.06867412783715449,
        -0.08586754042416206,
        0.10258048687954702,
        0.03576878897388158,
        0.050146281597286124,
        0.04449274326478936,
        -0.10478424904910738,
        -0.11559540957479691,
        -0.08708878656030178,
        -0.12021564929941253,
        -0.010166128208280223,
        -0.009359805948676025,
        -0.08315652129913598,
        -0.04444065517717266,
        0.004145919880922722,
        0.08552786729160444,
        -0.0029564444764242914,
        -0.061673911788272084,
        -0.07830622560137773,
        0.023077963928464007,
        0.06258182139069252,
        -0.08359183396441938,
        0.012568903001575538,
        -0.12137750849890239,
        0.12157036213828365,
        -0.0412222843148109,
        -0.02623025181375227,
        0.11335816292468187,
        -0.009464356178118527,
        -0.007977814698178431,
        0.04870506192943502,
        -0.11045650288768238,
        0.10036439751204512,
        -0.06529945635530754,
        0.0014349625705710745,
        0.04596460090172483,
        -0.05871804271461778,
        -0.015469383809176507,
        -0.03308724077494524,
        -0.06773715971684036,
        0.036243401657747976,
        -0.11927239289668384,
        -0.00001746797593077387,
        0.07152186929085658,
        0.09654001380719479,
        -0.04369478013183514,
        0.07207505315664597,
        -0.0606404585520921,
        -0.03821456979881277,
        0.015436905315961424,
        -0.11713239933354808,
        0.0019986636232038335,
        0.07218838528843474,
        0.02233615113044063,
        0.0618818961562817,
        -0.06131939861014102
      ],
      [
        -0.054592171129588876,
        -0.038273341909351305,
        0.012756901562403626,
        0.010038439289013502,
        -0.07265604472772026,
        -0.10126679502723225,
        0.07647425775305697,
        0.06627273961877182,
        -0.10176677515208023,
        -0.007721911769256287,
        -0.04778960732971211,
        -0.11476779323753808,
        -0.031440167621413204,
        -0.061242767188974735,
        0.10784951039822994,
        -0.03440276502076639,
        0.1047075668379253,
        0.06981389904593532,
        0.08406905300164674,
        0.08527681776728109,
        0.1074000309949717,
        -0.015777599670474575,
        0.10469331109887557,
        0.07328570786043279,
        0.0020491155231460254,
        0.08994850917087316,
        -0.021814279552529597,
        -0.01683409200648193,
        -0.006590800002080155,
        0.0989253005062563,
        -0.11662442036335251,
        0.02538322359092408,
        0.05174891421774518,
        0.11114984432903431,
        -0.015750193042096346,
        0.00524209072852373,
        0.11322422679426845,
        -0.0868222571539523,
        -0.010629491596442326,
        -0.05639922675571885,
        -0.0022502025176159342,
        -0.08951433720950917,
        0.025489673220002597,
        0.10867317714845882,
        0.013344245322079978,
        -0.032184082918547414,
        -0.015308653224345086,
        0.014774568103796645,
        0.01721496972686716,
        0.00881563380978891,
        0.0504072147562808,
        -0.07918200466772343,
        0.08406814847539902,
        0.09944016845729929,
        -0.063363362382517,
        -0.01597396985438915,
        0.03353041795862105,
        -0.10870120319393375,
        0.0005901742861772507,
        -0.11870561951555547,
        -0.01713375092808156,
        0.08427306694203164,
        -0.07891744149024257,
        0.005706648777881033
      ],
      [
        0.00518811039795769,
        0.033736991587101806,
        -0.0528011789767433,
        -0.06120557591627396,
        0.006187634416688403,
        -0.03580556480257824,
        -0.03343228987056135,
        -0.0033199645042295556,
        -0.016185840799736007,
        -0.004916685515870711,
        -0.044683448080181765,
        -0.07559343865516138,
        -0.050148601172262774,
        0.07431515145208323,
        -0.11903984767254211,
        0.06840101024573897,
        0.11416292807178019,
        0.11598052878175247,
        0.07607155476627858,
        0.0930802492031732,
        0.01410492099435956,
        -0.03224217707149474,
        -0.04285670763449462,
        0.07277857516636377,
        -0.12051661009346626,
        0.01631147771089836,
        -0.12459791960392408,
        0.06346971729587264,
        0.11914140668115092,
        -0.05697692938256543,
        -0.0864225448861396,
        0.0026779138255524915,
        -0.08867363631007436,
        -0.0929038963136648,
        -0.08200785029779811,
        0.021182763555327055,
        -0.07338814280993855,
        -0.05309969457029018,
        0.04635601700933689,
        0.05409900305039905,
        -0.007751692072947458,
        -0.10481325213824194,
        -0.005039510497683197,
        -0.09143074460600764,
        -0.10962985930926139,
        0.10364421547429231,
        -0.005163800068372193,
        0.08249212113854726,
        -0.08588634352612362,
        0.09700876836882971,
        -0.0658442387611528,
        -0.10249701784846782,
        -0.08695256553725333,
        0.06145288225682388,
        -0.10198683855883278,
        0.03451803444733886,
        0.013954854862286203,
        -0.10658221694093817,
        -0.10090736995436828,
        -0.061994216061430685,
        -0.012913698922702499,
        0.11493059340231049,
        -0.08414805882612875,
        -0.08046853705467955
      ],
      [
        -0.11743762652947776,
        -0.05256245331433185,
        0.02984410001780141,
        -0.10976198743786886,
        0.0008494576664345721,
        -0.05388674796742948,
        -0.06400337926116906,
        0.026226279849298484,
        0.029632426213222707,
        -0.01328466938435624,
        0.019080683558006184,
        -0.11912048143434179,
        -0.04879168100643083,
        0.03875523615152632,
        -0.06997776567677294,
        -0.06528950821837615,
        -0.07223879691990087,
        -0.04950412287986661,
        0.07446294173586698,
        0.07737196402198127,
        0.08540433133686387,
        0.09499862709071538,
        -0.023315984968271142,
        -0.04447412919509425,
        -0.021089514711500834,
        -0.05750282143015545,
        -0.1100519262013725,
        -0.02811434383025757,
        -0.045273892832035256,
        -0.11125510226453089,
        -0.005905534342976249,
        0.06451173754596462,
        0.06092938845933005,
        0.0825041430147489,
        -0.013364550621609239,
        0.02540103301432961,
        0.031651535098313865,
        -0.07494875681946689,
        0.09751654986157016,
        -0.0606072971806888,
        0.03611621339984833,
        0.005197834264168311,
        0.046113626864686674,
        0.011788238593395894,
        -0.11035102091663213,
        -0.039019499544751646,
        0.06374837717705495,
        -0.08347893648523658,
        0.07922960013222957,
        -0.05929491751265292,
        0.05672786111209127,
        -0.08211914232088091,
        -0.005835803694795749,
        0.06692497681481002,
        0.09542108690566165,
        -0.01485483837672491,
        -0.1014169294678211,
        -0.10266865810899761,
        0.012629136686228226,
        0.055005912015794856,
        0.03245826315900063,
        -0.015364426051961422,
        -0.08067804620344421,
        0.04765140799889239
      ],
      [
        -0.0732716925930818,
        0.0029052142527087876,
        -0.04360738706914319,
        0.10538900577123095,
        -0.0560648741496903,
        -0.02166945432561701,
        -0.0602732471751411,
        0.1035180317160016,
        -0.09414569383123322,
        0.06798124872352362,
        -0.03053880544091342,
        0.090533956136915,
        -0.03794485642986617,
        0.0315519317370872,
        -0.0014311215038737002,
        -0.01640299871197587,
        -0.11719757059401825,
        0.020816236455056036,
        0.11456985492077437,
        -0.04225965720580516,
        0.08048470172930888,
        0.04679582002793037,
        0.10930164372863066,
        -0.09436877451932102,
        -0.03435135861057753,
        0.0646433683281401,
        -0.023921699101949467,
        -0.048296811613973256,
        0.07470565725356243,
        0.09549615942392287,
        0.06185622733083346,
        -0.11827745003533219,
        0.07354785349390563,
        0.012086965355831258,
        0.04335647580826324,
        -0.08414557461922206,
        0.054001814101922174,
        0.11716903482856678,
        0.08033035916257336,
        0.03643296670249557,
        0.08376647937003195,
        0.04714595535890298,
        0.041781986049133635,
        0.04884504253800537,
        0.07522528872294237,
        0.10132979144757653,
        0.059852468728775865,
        -0.044119059067580624,
        0.06651431828851295,
        0.00008803872037649318,
        -0.11075674618829584,
        -0.04979500878831816,
        0.05920022714854267,
        0.031758228444772774,
        0.04816099038490429,
        0.010941046624818596,
        -0.027740855474448656,
        -0.02659432445590182,
        0.043736835429984355,
        0.10583287900328059,
        0.11021157171364854,
        0.04796396726726476,
        0.08141054429658079,
        0.11094640426557639
      ],
      [
        -0.003239688481704861,
        0.00396164145165645,
        -0.018755090839842503,
        -0.023098841238036516,
        0.03008376368868909,
        -0.07897732107520933,
        -0.07990507411712988,
        -0.07270767673534378,
        -0.055952329528224376,
        0.07735874457985426,
        -0.12274582546621082,
        -0.018231194445715526,
        0.04927625849787004,
        0.07522458049355296,
        0.04615601340694242,
        0.042814546448218305,
        -0.07207074171719408,
        0.08927396761210371,
        -0.022826656003467838,
        0.08242718592239962,
        -0.011804169139313758,
        -0.037239343122594026,
        -0.08569616055540158,
        0.06344773446966268,
        -0.04083434505047684,
        -0.04392070255480557,
        0.030023324721517586,
        -0.08277151285185708,
        0.11452732244169306,
        0.0044148968292727075,
        0.08030252577423569,
        0.03314840692384535,
        -0.051139079917676855,
        -0.1202193220711481,
        -0.12381102721678416,
        0.09062602663448888,
        0.09429282665433475,
        0.12073861899336497,
        -0.09438675590095202,
        0.11797443360673965,
        0.0724064760960374,
        0.08196118113442963,
        -0.0669337470622064,
        0.07106799264073782,
        -0.05635000136686141,
        -0.06651119265820948,
        -0.012654571021466499,
        -0.051806479446083575,
        0.04488034779777522,
        0.026160403831274104,
        -0.10242980344609948,
        -0.03861004607292534,
        -0.06885047372390818,
        0.05865138362012068,
        0.018132689395080892,
        -0.042502537964377696,
        0.08550256693287678,
        -0.09291408546566099,
        0.028787863693747195,
        0.01695430802537462,
        -0.1060564779604638,
        0.1051030579956021,
        0.04272432106989055,
        -0.024986530833302656
      ],
      [
        0.055028048925803874,
        -0.060218205178130035,
        0.03943733340444089,
        0.10713759152049318,
        -0.05541282862087643,
        -0.050667944491009365,
        0.09172164912896691,
        0.09779147685312894,
        -0.09528824225530064,
        -0.05582688043313594,
        -0.12013058780313957,
        0.12136711907016756,
        -0.03525705223808928,
        -0.002983157135726555,
        0.08613190045005331,
        -0.01002273504865464,
        -0.06280703631558704,
        0.0456011859501691,
        -0.011608633561526638,
        -0.025660462783036686,
        -0.07600873294753857,
        0.10128202104798872,
        -0.027561494341063197,
        -0.06991601780862433,
        0.12486608751250916,
        0.06632784059188851,
        -0.02162583662111972,
        0.09417248638012621,
        -0.06476522375566829,
        0.022172161780328103,
        0.027585602265986997,
        -0.06968986404167771,
        0.03361126861588959,
        0.00819289901582998,
        -0.0488790450636043,
        0.12242845362044052,
        0.10408971763962849,
        -0.07770677939415316,
        0.12435889682649615,
        0.009447433821441031,
        0.017446693865548313,
        -0.055927235774071216,
        -0.017564006918601605,
        0.10414200300719406,
        0.08201844517106982,
        0.11214833841201277,
        0.06524893315289104,
        0.022889842217369172,
        0.05376639620877505,
        0.0269755343768166,
        -0.016269199110513555,
        -0.10863808122983043,
        0.12091158380192285,
        0.02741335227772196,
        0.0038982895493331893,
        0.10793345996797232,
        -0.025918184773017716,
        -0.03855640214567002,
        0.03707866650390629,
        0.09636655820886414,
        0.06407402534689333,
        -0.10430156555930215,
        -0.07503116415771599,
        -0.03874798139048902
      ],
      [
        -0.0653002935609428,
        0.08414996470992903,
        -0.032057443150444065,
        0.011215418866170945,
        -0.02550033646409844,
        0.050186466190695944,
        -0.0038912097785657185,
        -0.11643291175900966,
        0.04063006832298477,
        -0.061591509532566424,
        0.049003403092364506,
        -0.03184978132712257,
        -0.08952075882010962,
        0.07883386821026767,
        -0.10610980077993076,
        0.026801417654308046,
        -0.03596330212437787,
        0.0854654935945387,
        0.06538982111573233,
        0.01731304880161344,
        0.01724176887772011,
        0.10471904035064383,
        -0.11871652340609656,
        -0.0751724878419569,
        -0.09421088791810267,
        -0.08403313096551623,
        0.10853448060135812,
        0.10533097910732303,
        -0.11227640393229216,
        0.07148713431483505,
        0.08141309295436422,
        -0.09062980937601672,
        -0.07746148845691203,
        0.0323593824572429,
        0.05494681487314129,
        0.09658232279224127,
        -0.001477237226285233,
        0.008942189358470909,
        0.05749554346608121,
        -0.05378465410988026,
        0.07866496249392657,
        0.03541267618235505,
        -0.04585593499102064,
        0.1214641939338793,
        -0.07825122742154667,
        0.09529704439504028,
        -0.1038494748193099,
        -0.09888038242817021,
        -0.009857848875656106,
        0.049844797272497354,
        -0.11271882680086254,
        0.018538539924733255,
        -0.00839993624736296,
        -0.01078529453251692,
        0.012167172495193446,
        0.1124138547592613,
        0.11293025463729406,
        -0.07677253500246012,
        0.12061206172833105,
        0.056526912726166,
        -0.1227702125710603,
        -0.08826399987949335,
        0.12004386973890369,
        0.04520736462672281
      ],
      [
        -0.0820544199073243,
        0.004218149311198424,
        -0.03472152304461416,
        -0.09113256928967679,
        0.03855770516818937,
        -0.11517299258183446,
        -0.062317185096916465,
        -0.0020114356879267553,
        -0.08882294259575184,
        -0.0336767676704093,
        -0.12000682796912958,
        0.020430701424376915,
        0.02708256704880726,
        -0.10425054758674922,
        -0.061874784774349524,
        0.0828865779828689,
        0.10537725180067398,
        0.03339207276469584,
        0.045701866119298024,
        0.012014258458270035,
        -0.007077006055939123,
        -0.11083566552031865,
        0.007378413271034439,
        -0.04208112466629033,
        -0.06438375378719315,
        0.05358176621238537,
        0.11536807910403647,
        0.12425072433211441,
        0.023376971594386033,
        -0.0932605023478416,
        -0.05400753495126625,
        -0.06453108052515508,
        0.10753165675672853,
        0.10254835922890959,
        0.03195612494075663,
        0.12379741411645856,
        0.08795165631059522,
        0.0818689728134641,
        -0.02690439565772383,
        -0.031171094819372434,
        -0.008653490986316039,
        -0.06935229186479726,
        0.011876606170769927,
        0.05534026073718586,
        0.03221834569841164,
        -0.00972406291023569,
        -0.08543442264047206,
        -0.007067943530359086,
        -0.0345343108483314,
        0.021782314695369794,
        0.024995884728181525,
        -0.06061980497117586,
        -0.008637412831734637,
        0.09850962469328778,
        -0.07970963442273662,
        -0.10956017157740432,
        0.08750568883034844,
        0.10436653949842833,
        -0.10903513848047527,
        0.12081653319072774,
        0.04786888499301316,
        -0.11710619053940373,
        -0.07876334851097423,
        0.04681897380278612
      ],
      [
        -0.06138304395058558,
        0.12031103799568493,
        -0.05056879039241763,
        -0.10858447386544845,
        0.08355148246761562,
        -0.1013188402293902,
        0.0007590145650143154,
        0.11217660947615055,
        -0.021287021207596124,
        -0.02348756800380969,
        0.016943472972691664,
        -0.03797967176757505,
        -0.11931163659700811,
        -0.11023055531068238,
        -0.021131921493657668,
        0.051902795256835554,
        -0.00390941969584141,
        0.037425053369384786,
        0.11268485137324052,
        0.09659715647063516,
        0.08135592224745786,
        -0.03159530670300936,
        0.0013853327258799286,
        -0.016058632958250607,
        -0.08100677236074538,
        -0.06791050814020255,
        -0.06999304341544993,
        0.008146421337010823,
        0.08653081681400415,
        -0.08982171248774856,
        -0.10145140014211107,
        -0.017343779775882362,
        -0.016115304854248946,
        0.12228169996046712,
        0.003602208798875739,
        -0.002983718823634407,
        -0.017402155157574983,
        -0.02901400805156007,
        0.061271241266642795,
        -0.12366828722101814,
        -0.0966973710910814,
        0.11317017468021351,
        0.122450085645264,
        -0.09279408509792325,
        0.027695425060880685,
        0.11122579281974543,
        0.09721903668300391,
        0.0716002838716236,
        -0.09218039977368542,
        0.05765838405948537,
        -0.10072962913016636,
        0.03263628514633915,
        0.044853957878934814,
        -0.05537807058879307,
        0.012714994097036914,
        0.015985320563121352,
        -0.10011783194118179,
        -0.0045280472293253715,
        -0.034410439559915684,
        0.061561781049653486,
        -0.001306426085431911,
        -0.12430308001541723,
        -0.08522199575754802,
        0.10061093594946285
      ],
      [
        0.026589852322100593,
        0.03884740183343549,
        -0.08311640958784905,
        -0.018148813361125282,
        0.002375327737986266,
        -0.10248652193264346,
        0.012490990765092691,
        0.02563616651225331,
        -0.03655602642030725,
        -0.0949634651111258,
        0.04244056147820319,
        0.11224637265172549,
        -0.035098343442659496,
        0.07346315376623225,
        0.012523415951579409,
        0.04689195658252521,
        0.07362750076009383,
        0.037808861331570076,
        -0.04432805635872067,
        -0.09175739179462211,
        -0.07367538612755614,
        0.12025108719864563,
        -0.06536191856284762,
        -0.09500411612429255,
        0.07641652015754791,
        0.09428766934230426,
        0.08762711187145383,
        0.09012785245271876,
        -0.011483328207237464,
        0.0675972231327645,
        -0.12133038943094138,
        0.04181356497090166,
        0.1137239445690803,
        -0.018946611993532148,
        0.09741033559227619,
        -0.08979622517155333,
        0.05478666718880826,
        -0.006318065620682045,
        0.10619727302430298,
        0.00924495192109559,
        0.07065304154096447,
        -0.042677847041592,
        0.07252002767562571,
        -0.07910306181968207,
        -0.09666699243914961,
        0.018940169434181364,
        -0.09846485903375685,
        0.05244491225917647,
        -0.11403537848582085,
        -0.005095310011586973,
        -0.1049033285353202,
        -0.0087362498372337,
        -0.11896525629519439,
        -0.09686075361216118,
        0.042475929660074796,
        0.024581765584077597,
        -0.09646495624592005,
        0.04817468548175863,
        -0.07549826441561958,
        -0.11355329952638776,
        0.05377833709351465,
        0.012265926244328651,
        0.034479784874032804,
        -0.07713997005887197
      ],
      [
        0.0376746111144759,
        -0.011574752337101923,
        0.042038961516355056,
        -0.11132088848877791,
        -0.09500808318454079,
        0.04225843352564235,
        0.05456632399892458,
        -0.04011072843749802,
        -0.03863314614956537,
        -0.08651265013553394,
        0.0700520193942108,
        0.11081189122811236,
        -0.0499278164803752,
        -0.10185788081896296,
        0.11333253041105223,
        -0.1236212883563998,
        0.07549966035533434,
        -0.1222103295160401,
        0.031611962219370626,
        0.11309585921600013,
        0.09458153546817788,
        -0.059404393629885255,
        0.04247206549148114,
        -0.09499403939882828,
        0.059246809388819044,
        0.10315013813064816,
        0.04237306099503213,
        0.11808290264593657,
        -0.008154686053310878,
        0.07115433453150649,
        -0.023332868774643467,
        0.03566032697732047,
        0.040121030707416294,
        0.08109518496883722,
        -0.018146333347970556,
        0.08116750203606027,
        -0.10114858600979793,
        0.04349209088480932,
        -0.0630722479490537,
        0.04148629978403717,
        0.09967602638229267,
        -0.12376978095187141,
        0.06499720060575526,
        -0.022574464420127227,
        0.0539134178952097,
        0.050812972228908515,
        -0.04718657436610885,
        -0.12328016823236881,
        0.05821445467163444,
        -0.1028763450478638,
        -0.04264891224351103,
        0.016372258101683412,
        -0.020092466847601687,
        -0.08406696255899504,
        0.04963373955511641,
        -0.0014688403717709186,
        0.026659051873694717,
        -0.1167379937506503,
        0.03796363504394851,
        -0.07087410686348866,
        -0.09451152214972935,
        -0.11150332848473304,
        -0.05923675539215534,
        0.05876421773151169
      ],
      [
        0.11537994604879565,
        0.02487899896349194,
        -0.0020732857813074435,
        -0.013403338511370322,
        -0.08124318306706524,
        0.10756309897162675,
        -0.002768911449566036,
        0.10415176973477613,
        0.05153972321316791,
        -0.012925709057690082,
        -0.06410780637831526,
        -0.06951867180344884,
        -0.07521724090435417,
        -0.03047923989637752,
        -0.03308576203624791,
        0.09176379106225674,
        0.10301445175231688,
        0.04283361501769234,
        -0.0388256578452324,
        -0.1233282701192468,
        -0.12093736631459312,
        -0.056995324762391664,
        0.08403010939953459,
        0.08841312782910088,
        0.034030934603838436,
        -0.004060327596402791,
        -0.10797438672950876,
        0.03457009162177255,
        -0.06504474400671578,
        -0.10892169009269176,
        0.010764975810082955,
        -0.07521970086464586,
        -0.02666044639084697,
        -0.09486719121125509,
        -0.039157653511640245,
        -0.07073123768432282,
        0.09021704598347907,
        0.03867746288984508,
        -0.006021469577056515,
        0.1073220432350186,
        -0.12016422851424235,
        -0.01375932700507404,
        0.0943314905175286,
        0.07591978795829513,
        0.059314983151356526,
        -0.03427528800684704,
        0.057122926477859326,
        -0.08347583421089755,
        -0.037186450200972165,
        -0.10339476477334952,
        0.07043431791484106,
        0.08340191973888778,
        -0.012070940940650698,
        0.09289582002599284,
        0.06471200086534612,
        0.0015549544424856565,
        0.10287930566725029,
        -0.07936867251220164,
        0.09079331475016528,
        -0.09972480176619586,
        0.10223305757562284,
        -0.006680115079312543,
        0.02723801256937275,
        -0.10918906482567503
      ],
      [
        0.09436360845643892,
        0.05676406048763568,
        -0.076278647834444,
        -0.11200805527483748,
        -0.055791813540137444,
        -0.10279734930684396,
        -0.0422809406220711,
        -0.053999085741200326,
        0.11797614774230857,
        0.1122453828065728,
        -0.12223061826528446,
        0.0651563643793198,
        0.11348074385521012,
        -0.08932789735354586,
        0.10113783944687915,
        0.09098046972309824,
        -0.024398411671081234,
        -0.11627962945221663,
        0.003944468463144673,
        0.11581473864793501,
        -0.031154847751920154,
        -0.10456199110514247,
        -0.10357729955728391,
        -0.05965405721787539,
        0.02932034130869996,
        0.08315876606421499,
        -0.11257318626432523,
        -0.11310509582510209,
        0.0059178571728062575,
        -0.02750515293883154,
        0.06999373443318788,
        0.005788423176666619,
        0.048627950197249206,
        0.040242525620680945,
        0.09901726704621501,
        -0.10857874606308139,
        0.11866815354025378,
        -0.0697423982385354,
        -0.0903856125786074,
        -0.09907383633796644,
        0.015367782682548962,
        -0.01782791716862422,
        -0.08959986607097155,
        -0.09346964529206553,
        0.06106708481762954,
        0.007779480577497589,
        -0.10562465596278642,
        0.03770403467603338,
        -0.09885025984995613,
        -0.06384945826429689,
        0.07679028229463734,
        0.06512212936856741,
        0.02636663791521344,
        0.1237617217583014,
        -0.027401310016757,
        0.03145725888901046,
        -0.01357089196883153,
        -0.09862369918347363,
        -0.052222022929071174,
        0.04375620739812591,
        -0.08113265857070581,
        -0.06372764597560637,
        0.05604176266826519,
        0.06508439682662057
      ],
      [
        -0.04337194024269703,
        -0.05766515816934087,
        0.09266843757419141,
        -0.06727869423954169,
        0.014240784036877119,
        0.12120143435551589,
        -0.12244315630623986,
        -0.12254747794898652,
        -0.05685522339122856,
        -0.019842023388270402,
        -0.042193785934601935,
        -0.012935927411778958,
        0.11220555996162823,
        -0.06569696257099555,
        0.02878499999058326,
        0.0603686603795508,
        -0.06114523464399446,
        -0.07219765211459062,
        0.08783488517095911,
        0.08845526602306353,
        -0.11045017681169494,
        -0.1015229285148539,
        -0.04435893095802529,
        0.024919504662463343,
        0.08432603223541107,
        -0.06350176209313108,
        -0.111025902566451,
        -0.1204532026232828,
        0.11826434591176704,
        -0.08049011787164279,
        0.07892268946704917,
        -0.009545995448636269,
        -0.049447091795909115,
        0.009695818943100676,
        -0.05967603550191258,
        0.12133712219216541,
        -0.04742393064417916,
        -0.07261155465181945,
        0.11654620029848417,
        0.06712412907604087,
        0.0845043330207444,
        0.03283267324631739,
        -0.036748493406748906,
        -0.06590465371688259,
        -0.03939008136878497,
        -0.07411869252094971,
        -0.002064582155577477,
        -0.07427348265926426,
        0.041192498551517076,
        0.08494530049407234,
        -0.11598779378255863,
        -0.03479875582149716,
        -0.06992058677070723,
        -0.10141558990393096,
        0.089351117057486,
        0.06713116260934376,
        -0.09198638074369414,
        0.04923124135235285,
        -0.0012435339023310066,
        -0.01029215081953716,
        -0.11276507292828458,
        0.08801557540679417,
        0.017871179259217884,
        -0.09078158678036446
      ],
      [
        0.09053879806193216,
        0.10468979405825268,
        0.08246978791024334,
        -0.06425678713168381,
        0.022327944242011566,
        -0.04991236654414277,
        0.01069612251621982,
        0.04716603345696174,
        0.07736533758333197,
        -0.0019351540322096183,
        -0.05559155459231757,
        -0.11320503928967957,
        0.00573071265471653,
        -0.11238972782834683,
        0.10727817995115307,
        -0.055865566249515275,
        0.09930256925815417,
        0.06465638816810076,
        -0.07715964044843998,
        -0.07660058847626061,
        -0.06638007640671373,
        -0.09779554345630875,
        0.0704759638717476,
        0.08927643399261626,
        0.0030480791313349243,
        0.024036698149527524,
        0.03291433237171082,
        0.071027724255248,
        -0.07170485337155236,
        0.12103569575665013,
        -0.049111589692019175,
        -0.002353435868745535,
        0.07201892063219867,
        0.023112837633963323,
        0.003460731080247692,
        0.06014539787024836,
        -0.08586135249874283,
        -0.022556633061149467,
        -0.09411038838665137,
        0.07409360220135425,
        -0.07997193997788049,
        0.0914119547667519,
        -0.07696322320397198,
        0.03106377872100069,
        -0.00876647676608483,
        -0.10857644769025959,
        0.1120689982884544,
        0.04528499537815989,
        0.04699283611434529,
        -0.10239323864157096,
        -0.04767623822158473,
        0.02585580228427331,
        -0.057638956038250255,
        0.04590163956300419,
        -0.08900806876682749,
        0.03788370418692244,
        -0.07803515507560821,
        -0.037826484115964565,
        0.06834869606906774,
        0.09973721143295994,
        0.10008233106389486,
        0.0010489673916296849,
        -0.0724708639741008,
        -0.05424630680717929
      ],
      [
        0.04081662752179632,
        -0.09868680479968611,
        -0.06602482318991743,
        -0.020339956769834133,
        0.05927479034167843,
        0.03201939064791093,
        0.07520690018654458,
        -0.10174696217055973,
        0.08024838670116119,
        -0.04730723676865056,
        -0.09619025884509691,
        -0.028078609938558263,
        0.09122498750604424,
        0.12419760989393808,
        -0.12296995144264394,
        0.03324828660068646,
        0.040153683280381325,
        0.06286084038369316,
        -0.08583711816982109,
        -0.008050900008495177,
        -0.10313581562130231,
        0.03556563772574062,
        -0.10923145313553306,
        0.005461400589877263,
        0.05366984420447379,
        0.11733623725215053,
        0.10992362331134936,
        0.09840371976808865,
        -0.017693237206017398,
        0.06973774152502304,
        0.026456659848760944,
        0.005865301296359093,
        0.07261940362982033,
        0.0272428048450018,
        -0.006328488672759647,
        -0.050297985072430274,
        0.11157258690020627,
        0.1209122619977902,
        0.12430816782346826,
        0.025324988813747062,
        -0.002907958390136467,
        -0.057652305798114645,
        -0.02599735970416517,
        -0.010319074037050235,
        0.059851100351599684,
        -0.11738923751725794,
        0.024052057664337934,
        0.06824184518130666,
        0.12243752555526854,
        -0.015519223105533275,
        0.0197878807343721,
        0.05922366224589498,
        -0.10547175315456653,
        0.09841761873296656,
        -0.09515601655962669,
        -0.07295770023389286,
        -0.08019655871380554,
        -0.1039512738172309,
        -0.021649678968262087,
        0.06774436601318706,
        -0.10711915060283977,
        -0.048668813749734086,
        0.009006525084131578,
        0.03605959983380547
      ],
      [
        -0.03404973357050867,
        -0.09629576363301484,
        0.08297015967432608,
        0.12313491752409261,
        0.02654173059858317,
        -0.0026811630833636357,
        0.0002538978797493874,
        -0.11174088896217832,
        0.006348790055795583,
        0.04278108860173563,
        -0.10247909344562939,
        -0.05626136126999692,
        -0.0655529371345907,
        0.00814258899953585,
        -0.039993259645860146,
        0.06439403056466309,
        0.12093905885364081,
        -0.040986525345806046,
        0.02646339577483403,
        -0.11655641280432583,
        0.04347444316615823,
        -0.01236504788210202,
        -0.0524357681150977,
        0.02063303210530032,
        -0.10604414948837887,
        -0.0021927659942874156,
        0.02541008459828259,
        0.03539056377174771,
        -0.029435861868487345,
        -0.09888443730933821,
        0.09338053001306784,
        0.1108566583885246,
        -0.01902120529897189,
        -0.050882552879152165,
        0.018811574687564336,
        0.03545068168541171,
        0.0996071941849827,
        -0.09134944111830828,
        0.05334712392272728,
        -0.02645728175513984,
        0.09012529417004722,
        -0.07203753122565981,
        0.034765639566065376,
        -0.009350183907833043,
        -0.1092788942714154,
        0.08369167751817497,
        -0.11981303234384638,
        0.06638542039132161,
        -0.08460805007333672,
        -0.023965699851047406,
        -0.05421340391812679,
        0.1087176725679786,
        -0.07876361807978471,
        -0.09097397666622103,
        -0.11773356667254825,
        0.10481154347725513,
        -0.025810464087536844,
        0.04533052824678252,
        0.016356389418913486,
        0.05972652183684829,
        -0.058746623078740734,
        -0.010734720621901728,
        0.011662326421727709,
        0.09628090593095534
      ],
      [
        -0.12225099993661603,
        0.035884205951260795,
        0.028389103185044062,
        0.02281775126961627,
        0.0792269068112425,
        -0.07752315806250992,
        -0.10581731958066526,
        -0.10680686850153098,
        -0.024373012820707307,
        0.02202450893234631,
        0.06566557878749452,
        0.11754964826764802,
        -0.0005582193777829425,
        0.034069721332418534,
        0.01829008190010961,
        0.020362217503254176,
        0.09068285984927271,
        -0.015715445401702333,
        0.06999488042463142,
        0.02779025447020239,
        -0.047325727958982045,
        0.11685571497479663,
        -0.11173892886072223,
        0.05239779683822232,
        0.07178644669407164,
        -0.09135617707664978,
        -0.057192305263496945,
        0.01647964026636395,
        0.12267962564543211,
        -0.015171643691536119,
        0.025910290817191595,
        0.02845479453291877,
        -0.0250736956984704,
        0.09544208957765171,
        -0.04596543789072427,
        0.09517265298988331,
        0.03189885816431087,
        -0.028409715367914146,
        -0.06470614671740793,
        -0.07724957357986151,
        -0.08433073328437896,
        -0.03448819299983674,
        0.10312699114010365,
        -0.025401240123609115,
        -0.1122073082374696,
        0.05987447007430452,
        0.0015628097825320375,
        0.05251948641017734,
        -0.02037100872359371,
        -0.03628562341877423,
        0.07291495746085747,
        -0.014696601713323099,
        0.10415286768612764,
        -0.08384306164903943,
        0.05900014900950523,
        -0.03759945007172577,
        -0.07301110586107323,
        0.03983434342511244,
        -0.03127614384735461,
        -0.01181857231546507,
        -0.0786427255494882,
        -0.06616460152012221,
        0.06470557500379354,
        -0.10094720417862102
      ],
      [
        0.019952087924449302,
        0.037604089868845225,
        0.09116774607762446,
        0.09908227979727785,
        0.07398205855096612,
        -0.018343559988609592,
        -0.06590623845571886,
        -0.11060862626936824,
        -0.10236089990160685,
        0.09196712911876703,
        0.031301957678777415,
        -0.10259245605857237,
        0.04803639741280363,
        0.09696144663575196,
        -0.0010783620396888627,
        0.010667863214745998,
        -0.04416851247659698,
        -0.05808652603564762,
        0.06262492649022794,
        0.045849745434322076,
        0.01819595653171513,
        -0.012837549842343032,
        0.015219045795063113,
        -0.04596195583871038,
        0.09535837905378186,
        0.11451143818379206,
        -0.0442632354918292,
        0.050085189362590266,
        0.08413240962709889,
        0.019249169953342637,
        -0.023719366389291785,
        0.10685444174085656,
        -0.08800817476175654,
        -0.05409915744522187,
        0.053293700785497666,
        0.06079534444596585,
        0.021091539097476686,
        0.004316499422076625,
        0.1214756646179953,
        -0.048393660400366634,
        0.04233601983992691,
        0.05995852783164024,
        0.05377595512932298,
        -0.07774537125473813,
        0.0789468986503013,
        -0.11303153855717091,
        -0.01660628029973249,
        -0.09780512826933035,
        0.045113767855718634,
        -0.06345672778122141,
        -0.043872631836969433,
        0.03858824954188317,
        -0.09763935480954511,
        0.03424790787835208,
        0.10959512917015396,
        0.06846647211406093,
        0.088570890551607,
        0.00044398345661572636,
        0.057678159534543694,
        0.11204498374737953,
        -0.0757172559664947,
        -0.1132527649407099,
        0.031264174549483326,
        0.0004267744277349772
      ],
      [
        0.05890381189859234,
        -0.005113800854202766,
        0.12092039702149365,
        0.094163756991198,
        -0.037449858838819516,
        -0.11134458470713354,
        -0.008368279412271029,
        0.04041870915823481,
        -0.017160246104965082,
        0.020905444677882856,
        -0.031562160156736574,
        -0.014557339737813091,
        -0.07898312787855583,
        0.0033388097526727556,
        0.0512047736098743,
        0.07902082520693893,
        0.09812469792049067,
        0.10732340364037368,
        0.07829552442869303,
        -0.11512243097610991,
        -0.050891591023816796,
        -0.07133032485795837,
        -0.12216703594428735,
        -0.09864377429099092,
        0.024753824023082516,
        -0.03947517785507948,
        -0.0873934654187209,
        0.004377781112511525,
        0.07976208479737945,
        0.10994567410810169,
        -0.0737421785869381,
        -0.05622003943093273,
        -0.11121644125532132,
        -0.04940703451797329,
        0.11414631358257343,
        -0.01227531455299763,
        0.029811713034364584,
        -0.06282690699898408,
        0.12136692896250112,
        -0.09142271038597538,
        0.02261994139384338,
        -0.029539858393184792,
        0.051846988964358354,
        -0.06541291137403477,
        -0.09494490655674342,
        0.09751047940312424,
        -0.06089604684029237,
        -0.06982741947159554,
        0.03751149397523623,
        -0.10187713688558603,
        -0.026416425917141106,
        0.07593493892604009,
        0.06998790597948923,
